Repository: Aidmad/yomi_test
Catalog: lib/l10n/app_*.arb
Languages: ru

# popWarning
source: You selected more than 10 kana
ru: Вы выбрали более 10 каны

# bottomBar
source: Choose 10 kana to learn
ru: Выберите 10 каны для обучения

# bottomBarButton
source: Learn
ru: Обучить

# testTitle
source: Test
ru: Тест

# checkButton
source: Check
ru: Проверить

source: Result
ru: Результат

# completed
source: Test completed
ru: Тест завершен

# mistake1
source: You made
ru: Вы допустили

# mistake2
source: mistake
ru: ошибку

# mistake3
source: mistakes
ru: ошибок

# mistake4
source: out of 10 rounds
ru: из 10 раундов

# continueButton
source: Continue
ru: Продолжить

# tipsStep1Title
source: Welcome to よみTest app!
ru: Добро пожаловать в приложение よみTest!

# tipsStep1Text1
source: This app helps you to learn reading kana starting from hiragana up to forming sentences which will be presented in future updates.
ru: Это приложение поможет вам научится читать каны начиная с хираганы до формировании предложений, которые будут представлены в будущих обновлениях.

# tipsStep1Text2
source: Stay tuned!
ru: Следите за обновлениями!

# tipsStep1Text3
source: As for now this app will help you memorize each kana and their respective romaji. However as you go on less of romaji will be used since we are aiming for total recognition of Japanese characters.
ru: А тем временем это приложение поможет вам запомнить каждую кану и её соответствующую ромаджи. Однако по мере продвижения будет использоваться меньше ромаджи поскольку мы стремимся к полному распознаванию японских иероглифов.

# tipsStep1Text4
source: This app will present you the opportunity to test your memory of each kana by typing romaji and saving each answer in order to track your progress.
ru: Это приложение предоставляет вам возможность проверить свою память на каждую кану, набирая ромаджи и сохраняя каждый ответ для отслеживания вашего прогресса.

# tipsStep1Text5
source: In order to learn full scope of this app's capabilities please follow further instructions.
ru: Чтобы разузнать полностью все возможности этого приложения пожалуйста следуйте дальнейшими инструкциями.

# tipsStep1Text6
source: Goog luck!
ru: Удачи!

# tipsStepButton
source: Next
ru: Продолжить

# tipsFinishButton
source: Finish
ru: Закончить

# tipsStep2Text1
source: Hiragana
ru: Хирагана

# tipsStep2Text2
source: is the most basic Japanese phonetic script that represents every sound in Japanese language.
ru: это самая базовая фонетическая Японская роспись, которая представляет каждый звук Японского языка.

# tipsStep2Text3
source: It's also regarded as the best entry point in learning Japanese language. So this is where we will start by learning each kana from hiragana list.
ru: Оно также считается самой лучшей начальной точкой для изучения Японского языка. Итак, здесь мы начнем с изучения каждой каны из списка хираганы.

# tipsStep2Text4
source: To see full hiragana list you can scroll
ru: Чтобы увидеть полный список хираганы, вы можете прокрутить

# tipsStep2Text5
source: down
ru: вниз

# tipsStep2Text6
source: and
ru: и

# tipsStep2Text7
source: up
ru: вверх

# tipsStep2Text8
source: Select kana you want to learn by tapping on corresponding blocks
ru: Выберите кану, которую хотите выучить, нажимая на соответствующие блоки

# tipsStep2Text9
source: Click on
ru: Нажмите значок

# tipsStep2Text10
source: icon to clear all selected blocks
ru: чтобы очистить все выбранные блоки

# tipsStep2Text11
source: To open information panel in order to learn more about current lessons by tap on
ru: Чтобы открыть информационную панель и узнать больше о текущих уроках, нажмите на

# tipsStep2Text13
source: exclamation mark
ru: восклицательный знак

# tipsStep3Text1
source: You have to select exact 10 block in order to proceed to test
ru: Вам необходимо выбрать ровно 10 блоков, чтобы приступить к тестированию.

# tipsStep3Text2
source: You can only select up to 10 blocks. Click X icon to close pop up warning or tap anywhere outside of pop up to close it
ru: Вы можете выбрать не более 10 блоков. Чтобы закрыть всплывающее предупреждение, нажмите значок X или коснитесь любого места за пределами всплывающего окна

# tipsStep4Text1
source: Press
ru: Нажмите кнопку

# tipsStep4Text2
source: Learn
ru: Обучить

# tipsStep4Text3
source: button to go to
ru: чтобы перейти на страницу

# tipsStep4Text4
source: Test
ru: Тест

# tipsStep4Text5
source: page in order to test your kana memory
ru: и проверить свою память по канам

# tipsStep4Text6
source: Once pressed you will be tested on same kanas you selected
ru: После нажатия вы будете протестированы на тех же канах, которые вы выбрали.

# tipsStep5Text1
source: This where you can test your kana memorization
ru: Здесь вы можете проверить свое запоминание каны

# tipsStep5Text2
source: You can press back button to leave this test any time. Your previous progress will be saved as long as you press
ru: Вы можете нажать кнопку «Назад», чтобы выйти из этого теста в любое время. Ваш предыдущий прогресс будет сохраняться, пока вы нажимаете кнопку

# tipsStep5Text3
source: Check
ru: Проверить

# tipsStep5Text4
source: button regardless if you complete this test or not
ru: независимо от того, завершили вы этот тест или нет

# tipsStep5Text5
source: In order to fully finish test you need to complete all 10 rounds
ru: Чтобы полностью пройти тест, вам необходимо пройти все 10 раундов.

# tipsStep6Text1
source: This is kana card that displays all 10 selected kanas randomly. Depending if you typed it's romaji correctly or wrong it will be highlighted in green or red
ru: Это карта каны, на которой отображаются все 10 выбранных вами каны в разнообразном порядке. В зависимости от того, правильно или неправильно вы набрали их ромаджи, оно будет выделено зеленым или красным цветом

# tipsStep7Text1
source: All typed letters will be shown here
ru: Здесь будут показаны все набранные буквы

# tipsStep7Text2
source: To type romaji letters tap these buttons. You can delete each button by pressing
ru: Чтобы ввести буквы ромадзи, нажмите эти кнопки. Вы можете удалить каждую кнопку, нажав на кнопку

# tipsStep7Text3
source: Backspace
ru: Bозврата

# tipsStep7Text4
source: After typing letter press
ru: После ввода букв нажмите кнопку

# tipsStep7Text5
source: Check
ru: Проверить

# tipsStep7Text6
source: to see if you got it correctly or wrong. Also to save your progress and score
ru: чтобы проверить, правильно вы их набрали или нет. Также, чтобы сохранить свой прогресс и счет

# tipsStep8Text1
source: Here in result page you can see percentage of your score and how well you did on a test
ru: Здесь, на странице результатов, вы можете увидеть процент вашего балла и то, насколько хорошо вы справились с тестом

# tipsStep9Text1
source: If you made any amount of mistakes they will be displayed under percentage bar showing kanas and their correct romajis
ru: Если вы допустили какое-либо количество ошибок, они будут отображаться под процентной полосой, показывающей каны и их правильные ромаджи

# tipsStep9Text2
source: To proceed click
ru: Чтобы продолжить, нажмите кнопку

# tipsStep9Text3
source: Continue
ru: Продолжить

# andWord
source: and
ru: и

# noProgress
source: You need to complete this list in order to proceed
ru: Вам необходимо заполнить этот список, чтобы продолжить

# tipsStep10Text1
source: To go to next lesson you need to complete every kana in current list
ru: Чтобы перейти к следующему уроку, вам необходимо выполнить все каны из текущего списка

# tipsStep10Text2
source: After completing current list you can move to learn other lessons by pressing arrows at each side of the sheet
ru: После заполнения текущего списка вы можете перейти к изучению других уроков, нажимая стрелки с каждой стороны листа

# infoText1
source: Hiragana is the basic Japanese phonetic script. It represents every sound in the Japanese language.
ru: Хирагана — основная японская фонетическая письменность. Он представляет каждый звук японского языка.

# infoText2
source: Each character consists of sounds like 'a' (あ), i' (い), 'u' (う), 'e' (え), 'o' (お) with other characters combining with these 5 sounds to create certain vowels like 'ka' (か), 'ki' (き), 'ke' (け), etc.
ru: Каждый символ звуков состоит из таких звуков, как 'а' (あ), 'и' (い), 'у' (U), 'э' (E), 'o' (お), а также другие символы, которые комбинируются с этими пятью звуками, образуя определенные гласные, такие как 'кa' (か), 'ки' (き), 'кэ' (け) и т. д.

# infoText3
source: By combining these characters we create words. For example: word 'Hiragana' - 'ひらがな' is made of characters like 'ひ' - hi, 'ら' - ra, 'が' - ga (dakuon), 'な' - na. Or another word like 'cat' - 'neko' - 'ねこ' in Japanese is combination of characters like 'ね' - ne, 'こ' - ko. Another example: teacher - sensei - 'せんせい', 'せ' - se, 'ん' - n, 'せ' - se, 'い' - i and so on
ru: Комбинируя эти символы, мы создаем слова. Например: слово «Хирагана» - 'ひらがな' состоит из иероглифов типа 'ひ' - хи, 'ら' - рa, 'が' - гa (дакуон), 'な' - нa. Или другое слово, например, «кошка» - «нэко» - 'ねこ' на японском языке представляет собой комбинацию символов типа 'ね' - нэ, 'こ' - кo. Другой пример: учитель - сэнсэй - 'せんせい', 'せ' - сэ, 'ん' - н, 'せ' - сэ, 'い' - и и так далее

# infoText4
source: To properly learn to read in Japanese it is required to memorize each of these characters
ru: Чтобы правильно научиться читать по-японски, необходимо запомнить каждый символ.

# infoText5
source: Dakuon in Japanese refers to voiced consonant sounds in hiragana/katakana, created by adding two small dots (called dakuten, ゛) to voiceless characters, changing sounds like k to g, s to z, t to d, and h to b.
ru: Дакуон в японском языке относится к звонким согласным звукам в хирагане/катакане, которые создаются путем добавления двух маленьких точек (так называемых дакутен, ゛) к глухим иероглифам, изменения таких звуков, как к на г, с на з, т на д и х на б.

# infoText6
source: When you see ゛on characters remember to not read them same as base hiragana. For example: base hiragana か - 'ka' if it has ゛added on it then it turns to が - 'ga', etc.
ru: Когда вы видите ゛на символах, не забывайте не читать их так же, как базовую хирагану. Например: базовая хирагана か – «ка», если к ней добавлено ゛, то она превращается в が – «га» и т. д.

# infoText7
source: Then there is Handakuon which in Japanese refers to half-turbid sounds, specifically the 'p' sounds (pa, pi, pu, pe, po), created by adding a small circle (called a maru or handakuten) to the 'h' row of hiragana/katakana (は, ひ, ふ, へ, ほ). This diacritic changes the consonant from an 'h' sound to a 'p' sound, marking a semi-voiced consonant, contrasting with dakuon (voiced sounds with two dots) and essential for correct pronunciation in Japanese words like pan 'ぱん' - bread.
ru: Еще есть Хандакуон, который по-японски относится к полумутным звукам, в частности к звукам «п» (па, пи, пу, пе, по), созданным путем добавления маленького круга (называемого мару или хандакутен) к ряду «х» хираганы/катаканы (は, ひ, ふ, へ, ほ). Этот диакритический знак меняет согласную со звука «х» на звук «п», обозначая полузвонкую согласную, контрастирующую с дакуон (звонкие звуки с двумя точками) и необходимую для правильного произношения в японских словах, таких как пaн 'ぱん' - хлеб.

# infoText8
source: So instead of reading just は - 'ha' you'd read it as ぱ - 'pa' and so on.
ru: Таким образом, вместо того, чтобы читать просто は – «ха», вы должны читать это как ぱ – «па» и так далее.

# infoText9
source: In the Japanese language, yōon refers to a feature where a consonant sound is palatalized by an added 'y' glide sound, resulting in a single contracted syllable or mora.
ru: В японском языке йyн относится к особенности, при которой согласный звук палатализируется добавленным звуком скольжения «у», в результате чего образуется один сокращенный слог или мора.

# infoText10
source: In both hiragana and katakana, the second character is written as a smaller-than-usual version of the ya - や, yu - ゆ, or yo - よ kana to distinguish it from two separate morae.
ru: И в хирагане, и в катакане второй иероглиф записывается как уменьшенная, чем обычно, версия каны я-や, ю-ゆ или йо-よ, чтобы отличить ее от двух отдельных мораэ.

# infoText11
source: When pronounced, the initial 'i' vowel sound is dropped, and the consonant is blended with the 'y' sound to form a single, smooth sound. For example, 'ki' (き) + small 'yo' (ょ) becomes 'kyo' (きょ), as a single sound, not 'kiyō'.
ru: При произнесении начальный гласный звук 'и' опускается, а согласная смешивается со звуком 'y', образуя единый плавный звук. Например, сочетание 'ки' (き) + маленькое 'йо' (ょ) превращается в 'кё' (きょ) как один звук, а не в 'киё'.
